---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.IsFontUnderline
source: html/fc70ad06-4e49-1689-f1a5-d14c03245fc1.htm
---
# Autodesk.Revit.DB.TableCellStyle.IsFontUnderline Property

Gets or sets whether the text font is set to Underline of this cell.

## Syntax (C#)
```csharp
public bool IsFontUnderline { get; set; }
```